app/controllers/api/cart_items_controller.rb

    def update
        @item = CartItem.find_by(id:params[:id])
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def destroy
        @item = CartItem.find_by(id:params[:id])
        @item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 2]]

    def duplicate_cart_coffee?(cart_item_params)
        cart_item = current_user.carted_coffees.where('coffee_id=?',cart_item_params[:coffee_id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]