app/controllers/api/carts_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def show
    @cart_items = Cart.find_by(user_id:current_user.id).cart_items