app/controllers/api/dtcoffees_controller.rb

    def show
        @dtcoffee = Dtcoffee.find_by(id:params[:id])
---
SELECT  "dtcoffees".* FROM "dtcoffees" WHERE "dtcoffees"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @dtcoffees = Dtcoffee.all
---
SELECT "dtcoffees".* FROM "dtcoffees"