app/controllers/api/taste_profiles_controller.rb

INSERT INTO "taste_profiles" ("user_id", "experience_level", "brew_method", "additions", "roast", "adventure", "ground", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @taste_profile = TasteProfile.new(profile_params)
        if @taste_profile.save

SELECT  "taste_profiles".* FROM "taste_profiles" WHERE "taste_profiles"."user_id" = $1 LIMIT $2  [["user_id", 22], ["LIMIT", 1]]
---
    def show
        @taste_profile = TasteProfile.find_by(user_id: params[:id])

SELECT  "taste_profiles".* FROM "taste_profiles" WHERE "taste_profiles"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
UPDATE "taste_profiles" SET "experience_level" = $1, "brew_method" = $2, "additions" = $3, "roast" = $4, "adventure" = $5, "updated_at" = $6 WHERE "taste_profiles"."id" = $7  [["experience_level", 4], ["brew_method", "Coffee Maker"], ["additions", "Milk or Cream"], ["roast", 1], ["adventure", "medium"], ["updated_at", "2020-05-04 20:06:35.138814"], ["id", 9]]
---
    def update

        @taste_profile = TasteProfile.find_by(user_id: profile_params['user_id'])
        if @taste_profile
            @taste_profile.update_attributes(profile_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE (user_id = 6)
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 1]]
SELECT "matches".* FROM "matches" WHERE (user_id = 5)
---
    def delete_old_matches(taste_profile)
        old_matches = Match.where("user_id = ?",taste_profile.user_id)
        old_matches.each {|match| match.destroy}

INSERT INTO "matches" ("user_id", "coffee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["coffee_id", 34], ["created_at", "2020-05-04 17:53:04.520575"], ["updated_at", "2020-05-04 17:53:04.520575"]]
---
    def create_matches(taste_profile)
        roast_range = taste_profile.get_match_params[0]
        price_range = taste_profile.get_match_params[1]
        matched_coffees = Dtcoffee.where("price >= ? AND price <= ? AND
                            roast >= ? AND roast <= ?",price_range[0],
                            price_range[1],roast_range[0],roast_range[1]).limit(5)
        matched_coffees.each do |matched|
            Match.create!(coffee_id: matched.id, user_id: taste_profile.user_id)