app/views/api/users/_user.json.jbuilder

SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = $1  [["user_id", 6]]
---
json.extract! current_user, :id, :email
json.matches  current_user.matches.map{|match|match.coffee_id}