app/views/api/users/show.json.jbuilder

SELECT "matches".* FROM "matches" WHERE "matches"."user_id" = $1  [["user_id", 6]]
---
json.extract! @user, :id, :email
json.matches  @user.matches.map{|match|match.coffee_id}